In [1]:
#Merging = join columns base on key columns (like join in sql)
# 4 types of join: inner, left, right, outer
# Categories of join/merge: 
# one-to-one join: join 2 datasets with unique keys
# many-to-one join: join 2 datasets with 1 unique keys and the other is duplicate keys
# many-to-many join: join 2 datasets with both duplicate keys

In [3]:
# one-to-one join

import pandas as pd

# dummy dataframes
df1 = pd.DataFrame({"product" : ["Prod_1", "Prod_2", "Prod_3", "Prod_4"], 
                   "division": ["Div_A", "Div_B", "Div_C", "Div_B"],
                   })

df2 = pd.DataFrame({"sales" : ["12500", "10800", "5600", "7900"],
                   "product" : ["Prod_3", "Prod_2", "Prod_4", "Prod_1"]})

display(df1, df2)

  product division
0  Prod_1    Div_A
1  Prod_2    Div_B
2  Prod_3    Div_C
3  Prod_4    Div_B

   sales product
0  12500  Prod_3
1  10800  Prod_2
2   5600  Prod_4
3   7900  Prod_1

In [4]:
#merge function: join 2 data frames
df3 = pd.merge(df1, df2)

In [5]:
df3 #they join just like in sql

  product division  sales
0  Prod_1    Div_A   7900
1  Prod_2    Div_B  10800
2  Prod_3    Div_C  12500
3  Prod_4    Div_B   5600

In [6]:
# Many-to-one join

# Dummy Dataframe 4
df4 = pd.DataFrame({"division" : ["Div_A", "Div_B", "Div_C"],
                   "manager" : ["Roger", "Rafael", "Novak"]})

# merge
df5 = pd.merge(df3, df4)

In [7]:
df5

  product division  sales manager
0  Prod_1    Div_A   7900   Roger
1  Prod_2    Div_B  10800  Rafael
2  Prod_4    Div_B   5600  Rafael
3  Prod_3    Div_C  12500   Novak

In [9]:
# Many-to-many join
df6 = pd.DataFrame({"division" : ["Div_A", "Div_A", "Div_B", "Div_C", "Div_C", "Div_C"],
                   "emp_grade" : ["13", "14+", "12", "11", "10", "9-"]})

df6

  division emp_grade
0    Div_A        13
1    Div_A       14+
2    Div_B        12
3    Div_C        11
4    Div_C        10
5    Div_C        9-

In [10]:
df7 = pd.merge(df5, df6)

In [11]:
df7

  product division  sales manager emp_grade
0  Prod_1    Div_A   7900   Roger        13
1  Prod_1    Div_A   7900   Roger       14+
2  Prod_2    Div_B  10800  Rafael        12
3  Prod_4    Div_B   5600  Rafael        12
4  Prod_3    Div_C  12500   Novak        11
5  Prod_3    Div_C  12500   Novak        10
6  Prod_3    Div_C  12500   Novak        9-

In [12]:
#Columns name often don't match, so merge keys is better
#There are 3 ways to merge keys

In [13]:
#1. Use on parameter
pd.merge(df1, df2, on = "product")

  product division  sales
0  Prod_1    Div_A   7900
1  Prod_2    Div_B  10800
2  Prod_3    Div_C  12500
3  Prod_4    Div_B   5600

In [16]:
#2. Use left_on, right_on

#change the name of column of df1
df1_new = pd.DataFrame({"project" : ["Prod_1", "Prod_2", "Prod_3", "Prod_4"], 
                   "division": ["Div_A", "Div_B", "Div_C", "Div_B"],
                   })
# merge 2 df
display(pd.merge(df1_new, df2, left_on = "project", right_on = "product"))

  project division  sales product
0  Prod_1    Div_A   7900  Prod_1
1  Prod_2    Div_B  10800  Prod_2
2  Prod_3    Div_C  12500  Prod_3
3  Prod_4    Div_B   5600  Prod_4

In [19]:
# We merge 2 data frame, but 2 columns show up. To fix this, use drop function to drop 1 of 2 columns
display(pd.merge(df1_new,
                 df2,
                 left_on = "project",
                 right_on = "product",
                ).drop("product", axis = 1)) #the axis = 1 is to choose column-wise, not index

  division  sales product
0    Div_A   7900  Prod_1
1    Div_B  10800  Prod_2
2    Div_C  12500  Prod_3
3    Div_B   5600  Prod_4

In [26]:
#3. Use left_index, right_index to merge keys base on index
#a. setting index
df1_index = df1_new.set_index("project")
df2_index = df2.set_index("product")

display(df1_index, df2_index)

        division
project
Prod_1     Div_A
Prod_2     Div_B
Prod_3     Div_C
Prod_4     Div_B

         sales
product
Prod_3   12500
Prod_2   10800
Prod_4    5600
Prod_1    7900

In [28]:
#b. merge base on index
df_new = pd.merge(df1_new, df2, left_index = True, right_index = True)
display(df_new)

  project division  sales product
0  Prod_1    Div_A  12500  Prod_3
1  Prod_2    Div_B  10800  Prod_2
2  Prod_3    Div_C   5600  Prod_4
3  Prod_4    Div_B   7900  Prod_1

In [29]:
# The "how" parameter: let you specify how you want your data to join
# The "how" parameter has 4 types of join: inner, left, right, and outer (exactly like SQL)

# dummy dataframes with actor names from the moves Ironman
# and Avengers: End Game

df_a = pd.DataFrame({"id" : ["1", "2", "3", "4"], 
                   "actor_first_name": ["Robert", "Gwyneth", "Jon", "Paul"],
                   "actor_last_name" : ["Downey Jr.", "Paltrow", "Favreau", "Bettany"],
                   "value" : ["10", "6", "7", "7"]
                   })

df_b = pd.DataFrame({"id" : ["1", "2", "3", "4", "5", "6"], 
                    "actor_first_name" : ["Robert", "Chris", "Chris", "Mark", "Scarlett", "Jeremy"],
                    "actor_last_name" : ["Downey Jr.", "Evans", "Hemsworth", "Ruffalo", "Johansson", "Renner"]
                    })

display(df_a, df_b)

  id actor_first_name actor_last_name value
0  1           Robert      Downey Jr.    10
1  2          Gwyneth         Paltrow     6
2  3              Jon         Favreau     7
3  4             Paul         Bettany     7

  id actor_first_name actor_last_name
0  1           Robert      Downey Jr.
1  2            Chris           Evans
2  3            Chris       Hemsworth
3  4             Mark         Ruffalo
4  5         Scarlett       Johansson
5  6           Jeremy          Renner

In [52]:
#inner join
df_inner = pd.merge(df_a, df_b,
                    on = ["actor_first_name", "actor_last_name"],
                    how = "inner").drop("id_y", axis = 1) #drop the id in the right data frame

#rename the column id_x back to id
df_inner = df_inner.rename(columns = {"id_x": "id"})
df_inner

  id actor_first_name actor_last_name value
0  1           Robert      Downey Jr.    10

In [51]:
#left join
df_left = pd.merge(df_a, df_b,
                   left_on = ["actor_first_name", "actor_last_name"],
                   right_on = ["actor_first_name", "actor_last_name"],
                   how = "left").drop("id_y", axis = 1)

#rename the column id_x back to id
df_left = df_left.rename(columns = {"id_x": "id"})
df_left#out

  id actor_first_name actor_last_name value
0  1           Robert      Downey Jr.    10
1  2          Gwyneth         Paltrow     6
2  3              Jon         Favreau     7
3  4             Paul         Bettany     7

In [49]:
#right join
display(pd.merge(df_a, df_b, how = "right"))

  id actor_first_name actor_last_name value
0  1           Robert      Downey Jr.    10
1  2            Chris           Evans   NaN
2  3            Chris       Hemsworth   NaN
3  4             Mark         Ruffalo   NaN
4  5         Scarlett       Johansson   NaN
5  6           Jeremy          Renner   NaN

In [53]:
#outer join
display(pd.merge(df_a, df_b, how = "outer"))

  id actor_first_name actor_last_name value
0  1           Robert      Downey Jr.    10
1  2          Gwyneth         Paltrow     6
2  3              Jon         Favreau     7
3  4             Paul         Bettany     7
4  2            Chris           Evans   NaN
5  3            Chris       Hemsworth   NaN
6  4             Mark         Ruffalo   NaN
7  5         Scarlett       Johansson   NaN
8  6           Jeremy          Renner   NaN

In [54]:
#you can identify which row is in which data frame
display(pd.merge(df_a, df_b,
                 how = "outer",
                indicator = True)) #create a cloumn to show merge

  id actor_first_name actor_last_name value      _merge
0  1           Robert      Downey Jr.    10        both
1  2          Gwyneth         Paltrow     6   left_only
2  3              Jon         Favreau     7   left_only
3  4             Paul         Bettany     7   left_only
4  2            Chris           Evans   NaN  right_only
5  3            Chris       Hemsworth   NaN  right_only
6  4             Mark         Ruffalo   NaN  right_only
7  5         Scarlett       Johansson   NaN  right_only
8  6           Jeremy          Renner   NaN  right_only

In [56]:
# How to create suffixes in dataframe

df_s1 = pd.DataFrame({"product" : ["Prod_1", "Prod_2", "Prod_3", "Prod_4"], 
                   "division": ["Div_A", "Div_B", "Div_C", "Div_D"],
                   })

df_s2 = pd.DataFrame({"product" : ["Prod_1", "Prod_2", "Prod_3", "Prod_4"], 
                   "division": ["Div_C", "Div_A", "Div_B", "Div_D"],
                   })
#merge 2 data frame
display(pd.merge(df_s1, df_s2, on = "product"))

  product division_x division_y
0  Prod_1      Div_A      Div_C
1  Prod_2      Div_B      Div_A
2  Prod_3      Div_C      Div_B
3  Prod_4      Div_D      Div_D

In [57]:
#division_x and division_y is confusing, we can create suffixes to make it clearer
#custom suffixes
display(pd.merge(df_s1, df_s2, on = "product", suffixes = ["_LD", "_RD"]))

  product division_LD division_RD
0  Prod_1       Div_A       Div_C
1  Prod_2       Div_B       Div_A
2  Prod_3       Div_C       Div_B
3  Prod_4       Div_D       Div_D

In [58]:
# Update dataframes

df1_update = pd.DataFrame({'c1':['a','a','b','b'], 
                           'c2':['x','y','x','y'],
                           'val':0})

df2_update = pd.DataFrame({'c1':['a','a','b', 'b'],
                           'c2':['x','y','x', 'y'],
                           'val':[12,31,14,20]})

display(df1_update, df2_update)

  c1 c2  val
0  a  x    0
1  a  y    0
2  b  x    0
3  b  y    0

  c1 c2  val
0  a  x   12
1  a  y   31
2  b  x   14
3  b  y   20

In [61]:
# update the data from df2_update into df1_update
df1_update.update(df2_update)
df1_update #now the df1_update contain the data in df2_update

  c1 c2  val
0  a  x   12
1  a  y   31
2  b  x   14
3  b  y   20